package lesson6;

public class Lesson6 {
    public static void main(String[] args) {

        // форматування коду




        /*
        Делегування
         */

        // додати класи





        /*
        Пакети
         */

        // два класи з однаковим іменем - Rock

        // створити об'єкти обох класів

        // доступ до методів та змінних з різними рівнями доступу

        // приклади стандартних пакетів



        /*
        Інтерфейси
         */

        // додати клас Книга

        // додати інтерфейси Видавницто, Автор

        // створення об'єкту інтерфейсу

        // змінні в інтерфейсах

        // чекнути чи вибрана Java 8
        // дефолтні методи

        // виклик дефолтних методів

        // перекриття дефолтних методів

        // посилання інтерфейсного типу

        // передача інтерфейсного типу в метод

        // повернення інтерфейсного типу з методу

        // конфлікт дефолтних методів

        // вирішення конфлікту

        // static методи

        // доступ до статичних методів інтерфейсів

        // наслідування в інтерфейсах

        // вкладені інтерфейси

        // приклади стандартних інтерфейсів

    }
}
