package lesson6;

public class Lesson6 {
    public static void main(String[] args) {

        // форматування коду

        /*
        Пакети
         */

        // два класи з однаковим іменем - Rock

        // створити об'єкти обох класів

        // доступ до методів та змінних з різними рівнями доступу



        /*
        Делегування
         */

        // додати класи



        /*
        Інтерфейси
         */

        // додати клас Книга

        // додати інтерфейси Видавницто, Автор

        // змінні в інтерфейсах

        // чекнути чи вибрана Java 8
        // дефолтні методи

        // виклик дефолтних методів

        // перекриття дефолтних методів

        // конфлікт дефолтних методів

        // вирішення конфлікту

        // static методи

        // доступ до статичних методів інтерфейсів

        // наслідування в інтерфейсах

    }
}
