package lesson4;

public class Lesson4 {
    public static void main(String[] args) {

        /*
        Наслідування
         */
        // створити клас Тварина
        // створити клас Собака
        // унаслідувати клас собака від класу тварини
        // додати тварині змінну вага
        // показати що вона є і у класу собака
        // додати до класу тварина ще три змінні, з різними рівнями доступу (ріст, висота, ширина)
        // додати до класу тварини 2 конструктори (без параметрів і який приймає ріст)
        // видалити конструктор з параметрами
        // ключове слово super

        // super виклик перекритих змінних
        // додати до класу собака два конструктори
        // ініціалізувати собаку через обидва конструктори
        // переписати безпарамертний конструктор, щоб викликати параметризований
        // додати методи до класу тварина (їсти, спати)
        // додати метод до класу собака, показати його виклик
        // додати приватний метод до тварини
        // додати клас кіт
        // перевизначити / перектрити метод спати в обох класах
        // додати метод кусати
        // додати клас Бульдог
        // перекрити метод кусати
        // super виклик перекритих методів

        /*
        Агрегація
         */
        // створити класи людина і гаманець
        // доступ до методів агрегованого класу

        /*
        Композиція
         */
        // створити класи людина і мозок
        //

        // приватний конструктор - Сінглтон

        // створити класи Людина, Чоловік, Жінка
        // додати по одному методу в кожен клас, методи приймають об'єкт типу тварину на вхід
        // показати доступ до цих методів в залежності від типу змінної яка посилається на об'єкти
        // показати явне приведення
        // помилка при приведенні
        // instanceof
    }
}
